Frontend/tools.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-11-21 周三 01:12 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>前端工程化</title>
<meta name="generator" content="Org mode">
<meta name="author" content="孙悟空">
<link rel='stylesheet' href='/asset/common.css' />
</head>
<body>
<div id="content">
<header>
<h1 class="title">前端工程化</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org868e0b6">1. babel</a></li>
<li><a href="#org80fa3a8">2. 针对 vue，vue-loader 工具</a></li>
<li><a href="#org48fed49">3. npm/yarn</a></li>
</ul>
</div>
</nav>


<section id="outline-container-org868e0b6" class="outline-2">
<h2 id="org868e0b6"><span class="section-number-2">1</span> babel</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://babeljs.io/">https://babeljs.io/</a>
</p>

<p>
这是一个翻译工具。我们使用 es6/es7 等新的语法编程，经过 babel 的翻译之后，它就能兼容不支持 es6/7 的浏览器。
</p>

<p>
它能把使用 es6/es7 等语法的文件，根据配置翻译成能够在指定浏览器使用的文件。
</p>

<p>
比如说，你可以指定，让它翻译成能够在 ie6 下面使用的使用。
</p>

<p>
你可以指定，让它翻译成能够兼容 ie8 的文件。
</p>

<p>
你也可以指定，让它翻译成能够兼容 ie10 的文件。
</p>
</div>
</section>
<section id="outline-container-org80fa3a8" class="outline-2">
<h2 id="org80fa3a8"><span class="section-number-2">2</span> 针对 vue，vue-loader 工具</h2>
</section>
<section id="outline-container-org48fed49" class="outline-2">
<h2 id="org48fed49"><span class="section-number-2">3</span> npm/yarn</h2>
<div class="outline-text-2" id="text-3">
<p>
下载插件，下载工具，简单的任务管理。
</p>

<p>
npm(nodejs package manager)，它是伴随 nodejs 出现的一个工具包。
</p>

<p>
使用相当简单。
</p>

<p>
第一步，下载。
</p>

<p>
第二步，安装。
</p>

<p>
第三步，使用。
</p>

<p>
基本命令如下:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">&#21021;&#22987;&#21270;&#19968;&#20010;&#39033;&#30446;&#65292;&#22312;&#39033;&#30446;&#19979;&#38754;&#21019;&#24314;&#22522;&#26412;&#30340;&#37197;&#32622;&#25991;&#20214; package.json</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">package.json &#26159;&#23646;&#20110; CommonJS &#35268;&#33539;&#30340;&#19968;&#20010;&#37197;&#32622;&#25991;&#20214;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&#22240;&#20026; npm &#20351;&#29992;&#30340;&#26159; CommonJS &#35268;&#33539;&#65292;&#25152;&#20197;&#65292;&#20182;&#20063;&#20351;&#29992;&#20102;&#21516;&#26679;&#30340; package.json &#20316;&#20026;&#23427;&#30340;&#37197;&#32622;&#25991;&#20214;</span>
npm init

<span class="org-comment-delimiter"># </span><span class="org-comment">&#19979;&#36733;&#19968;&#20010;&#25554;&#20214;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">&#19979;&#36733;&#23436;&#20043;&#21518;&#65292;&#40664;&#35748;&#20250;&#23433;&#35013;&#21040;&#24403;&#21069;&#30446;&#24405;&#19979;&#30340; node_moduels &#25991;&#20214;&#22841;&#37324;</span>
npm install jQuery
npm install electron --global
npm install vue

<span class="org-comment-delimiter"># </span>
</pre>
</div>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 孙悟空</p>
<p class="date">Created: 2018-11-21 周三 01:12</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
